farhadreza/Display-Bitmap-String-in-OLED-in-LM3S811-ARM-Cortex-M3-Microcontroller/OLED_LM3S811 ARM Cortex M3-Microcontroller.c
//*****************************************************************************
//
// Display Bitmap and String in OLED Output using 
// Input Switch in LM3S811 ARM Cortex M3-Microcontroller
// Author: MD Farhadur Reza
// University of Louisiana at Lafayette

//*****************************************************************************

#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/adc.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h"
#include "driverlib/uart.h"
#include "drivers/display96x16x1.h"
#include "inc/lm3s811.h"
//#include "game.h"
#include "globals.h"
#include "random.h"
//#include "screen_saver.h"
#include "Output.h"
#include<string.h>


//
//
//     xxx.......xxxx....xxxxxxxxxxxxx....xxx....xxx..........
//     xxx.....xxxx......xxxxxxxxxxxxx....xxx....xxx..........
//     xxx...xxxx........xxx..............xxx....xxx..........
//     xxxxxxxx..........xxxxxxxxxxxxx....xxx....xxx..........
//     xxxxxxxx..........xxxxxxxxxxxxx....xxx....xxx..........
//     xxx...xxxx........xxx..............xxx....xxx..........
//     xxx.....xxxx......xxxxxxxxxxxxx....xxx....xxxxxxxxxxxxx
//     xxx.......xxxx....xxxxxxxxxxxxx....xxx....xxxxxxxxxxxxx
//     .......................................................
//     .......................................................
//     .x.........x..xx..x...x....xx..........................
//     x.x.......x.x.x.x.xx.xx...x............................
//     xxx.xx....xxx.xx..x.x.x...x....x..xx.x..xx...xx.xx..x.x
//     x.x.x.x...x.x.x.x.x...x...x...x.x.x.x.x.x.x.x.x.x.x.x.x
//     x.x.x.x...x.x.x.x.x...x....xx..x..x.x.x.xx...xx.x.x..x.
//     ........................................x...........x..
//
//*****************************************************************************
#if defined(rvmdk) || defined(__ARMCC_VERSION)
static const unsigned char g_pucKeilLogo[152] =
{
    0xff, 0x02, 0x04, 0x09, 0x13, 0x25, 0x49, 0x91, 0x21, 0x41, 0x81, 0x01,
    0x01, 0x01, 0x01, 0x01, 0x01, 0xff, 0x00, 0x00, 0x00, 0xff, 0xff, 0xff,
    0x18, 0x18, 0x18, 0x3c, 0x3c, 0x66, 0x66, 0xc3, 0xc3, 0x81, 0x81, 0x00,
    0x00, 0x00, 0x00, 0xff, 0xff, 0xff, 0xdb, 0xdb, 0xdb, 0xdb, 0xdb, 0xdb,
    0xdb, 0xdb, 0xdb, 0xdb, 0x00, 0x00, 0x00, 0x00, 0xff, 0xff, 0xff, 0x00,
    0x00, 0x00, 0x00, 0xff, 0xff, 0xff, 0xc0, 0xc0, 0xc0, 0xc0, 0xc0, 0xc0,
    0xc0, 0xc0, 0xc0, 0xc0,
    0x7f, 0x20, 0x10, 0x48, 0x64, 0x52, 0x49, 0x44, 0x42, 0x41, 0x40, 0x40,
    0x40, 0x40, 0x40, 0x40, 0x40, 0x7f, 0x00, 0x00, 0x00, 0x78, 0x14, 0x78,
    0x00, 0x70, 0x10, 0x60, 0x00, 0x00, 0x00, 0x78, 0x14, 0x78, 0x00, 0x7c,
    0x14, 0x68, 0x00, 0x7c, 0x08, 0x10, 0x08, 0x7c, 0x00, 0x00, 0x00, 0x38,
    0x44, 0x44, 0x00, 0x20, 0x50, 0x20, 0x00, 0x70, 0x10, 0x60, 0x10, 0x60,
    0x00, 0xf0, 0x50, 0x20, 0x00, 0x20, 0x50, 0x70, 0x00, 0x70, 0x10, 0x60,
    0x00, 0xb0, 0x40, 0x30
};
static const unsigned char g_pucSmileLogo[194] =
{
    0x00,
	  0x00, 0x00, 0xf8, 0x04,0x02,0x39,0x39,0x01,
	  0x39, 0x39, 0x02, 0x04, 0xf8,0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  
	  0x00, 0x00, 0x1f,0x20, 0x42, 0x86,0x8a,0x8a,
	  0x8a, 0x86, 0x42,0x20, 0x1f, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  

	   
};


static const unsigned char g_pucSurpriseLogo[193] =
{
    0x00,
	  0x00, 0xf0, 0x08, 0x04, 0x02,0x19,0x99,0x81,
	  0x99, 0x19, 0x02, 0x04, 0x08,0xf0,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  
	  0x00, 0x0f, 0x10,0x24, 0x4a,0x89,0x88,0x88,
	  0x88, 0x89, 0x4a,0x24, 0x10, 0x0f,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  

	   
};



static const unsigned char g_pucSadLogo[193] =
{
    0x00,
	  0x00, 0xf0, 0x08, 0x04, 0x02,0x31,0x01,0x01,
	  0x01, 0x31, 0x82, 0x04, 0x08,0xf0,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  0x00, 0x00, 0x00,0x00, 0x00, 0x00,0x00,0x00,
	  
