farhadreza/Display-Bitmap-String-in-OLED-in-LM3S811-ARM-Cortex-M3-Microcontroller/OLED_LM3S811 ARM Cortex M3-Microcontroller.c
	  Output_Init();
    Output_Color(1);
    //
    // Initialize the OLED display.
    //
    Display96x16x1Init(true);

   

    //
    // Display the Code Composer Studio logo for five seconds.
    //
				/*
#if defined(ccs)
    DisplayLogo(g_pucCodeComposerLogo, 1, 94, 5 * CLOCK_RATE);
#endif

    //
    // Display the Keil/ARM logo for five seconds.
    //
#if defined(rvmdk) || defined(__ARMCC_VERSION)
    DisplayLogo(g_pucKeilLogo, 10, 76, 5 * CLOCK_RATE);
#endif

    //
    // Display the IAR logo for five seconds.
    //
#if defined(ewarm)
    DisplayLogo(g_pucIarLogo, 2, 92, 5 * CLOCK_RATE);
#endif

    //
    // Display the CodeSourcery logo for five seconds.
    //
#if defined(sourcerygxx)
    DisplayLogo(g_pucCodeSourceryLogo, 6, 83, 5 * CLOCK_RATE);
#endif

    //
    // Display the code_red logo for five seconds.
    //
#if defined(codered)
    DisplayLogo(g_pucCodeRedLogo, 9, 78, 5 * CLOCK_RATE);
#endif
*/

    //
    // Throw away any button presses that may have occurred while the splash
    // screens were being displayed.
    //
    HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS) = 0;
		
		

    //
    // Loop forever.
    //
    while(1)
    {
			  //HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)=0;
		  
			 // button_count = GPIOPinRead(GPIO_PORTC_BASE, PUSH_BUTTON) ? 1 : 0;
			
			 /* while(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS))
				{
					//smile
					button_count++;
					for(ulLoop = 0; ulLoop < 10000; ulLoop++)
						{
						}
					
					HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)=0;	
					while(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS))
					{
						//disappointed
					   button_count++;
						 for(ulLoop = 0; ulLoop < 10000; ulLoop++)
							{
							}
						 HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)=0;
						while(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS))
						{  //surprising
							  button_count++;
						    for(ulLoop = 0; ulLoop < 10000; ulLoop++)
							   {
							   }
								 HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)=0;
							  while(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS))
								{
									//sad
									 button_count++;
									for(ulLoop = 0; ulLoop < 10000; ulLoop++)
									{
									}
									 Display96x16x1ImageDraw(g_pucSadLogo, 40, 0, 96, 2);
								}
							
							
								  Display96x16x1ImageDraw(g_pucSurpriseLogo, 40, 0, 96, 2);
							}
						
						
						
						
							Display96x16x1ImageDraw(g_pucDisappointedLogo, 40, 0, 96, 2);
						}
						
					
			
			
							Display96x16x1ImageDraw(g_pucSmileLogo, 40, 0, 96, 2);
					}
						
					
				
					*/
					
					if(button_count==1)
						 {
							 GPIO_PORTC_DATA_R |= 0x20;
	 Display96x16x1StringDraw("Smile",0, 0);
	 for(ulLoop = 0; ulLoop < 500000; ulLoop++)
						{
						}
	 Display96x16x1Clear();
	 Display96x16x1ImageDraw(g_pucSmileLogo, 40, 0, 96, 2);
						 }
						 
			  else if(button_count==2)
						 {
							 Display96x16x1StringDraw("Disappointed",0, 0);
		GPIO_PORTC_DATA_R ^= 0x20;
		for(ulLoop = 0; ulLoop < 500000; ulLoop++)
        {
        }
		Display96x16x1Clear();
		Display96x16x1ImageDraw(g_pucDisappointedLogo, 40, 0, 96, 2);
		GPIO_PORTC_DATA_R ^= 0x20;
	  
		for(ulLoop = 0; ulLoop < 500000; ulLoop++)
						{
						}
						 }
				else if(button_count==3){
						 
				//blinkpressed=1;
							 Display96x16x1StringDraw("Surprise",0, 0);
	 for(ulLoop = 0; ulLoop < 500000; ulLoop++)
						{
						}
	 Display96x16x1Clear();
	 Display96x16x1ImageDraw(g_pucSurpriseLogo, 40, 0, 96, 2);
						
		while(1){
		GPIO_PORTC_DATA_R |= 0x20;
		for(ulLoop = 0; ulLoop < 100000; ulLoop++)
        {
        }
		GPIO_PORTC_DATA_R &= ~(0x20);
		//
        for(ulLoop = 0; ulLoop < 100000; ulLoop++)
        {
        }
			}
						 }
				else if(button_count==4)
						 {
							 GPIO_PORTC_DATA_R &= ~(0x20);
	 Display96x16x1StringDraw("Sad",0, 0);
	 for(ulLoop = 0; ulLoop < 500000; ulLoop++)
						{
						}
	 Display96x16x1Clear();
	 Display96x16x1ImageDraw(g_pucSadLogo, 40, 0, 96, 2);
						 }
				/*else{
							 Display96x16x1StringDraw("Do Nothing",0, 0);
						 }
				 */
					
			   while(!HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS))
				{
					//smile
				/*	if(blinkpressed=1){
						//blibk here
					}*/
					
				}
					
					HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)=0;	
					
			     button_count=1;
				
				/* for(ulLoop = 0; ulLoop < 1000000; ulLoop++)
							{
							}*/
				
				//2nd push button
				  for(ulLoop = 0; ulLoop < (300000*CLOCK_RATE / 4); ulLoop++)
				
			   {
					 end_pushing=1;
					 if(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)==1)
					 {
						 HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)=0;
						 button_count=2;
						 end_pushing=0;
						 break;
					 }
				 }
				 
				/* for(ulLoop = 0; ulLoop < 1000000; ulLoop++)
							{
							}*/
				 
				 //third push button
				 if(end_pushing==0){
				 for(ulLoop = 0; ulLoop < (300000*CLOCK_RATE / 4); ulLoop++)
				
			   {
					 end_pushing=1;
					 if(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)==1)
					 {
						 HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)=0;
						 button_count=3;
						 end_pushing=0;
						 break;
					 }
				 }
			 }
				 
			 //4th push button
				
			 if(end_pushing==0){
				 for(ulLoop = 0; ulLoop < (300000*CLOCK_RATE / 4); ulLoop++)
				
			   {
					 end_pushing=1;
					 if(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)==1)
					 {
						 HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)=0;
						 button_count=4;
						 end_pushing=0;
						 break;
					 }
				 }
			 }
			 
			 //fifth push button
			 
			 if(end_pushing==0){
				 end_pushing=1;
				 for(ulLoop = 0; ulLoop < (300000*CLOCK_RATE / 4); ulLoop++)
				
			   {
					 if(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)==1)
					 {
						 button_count=0;
						 end_pushing=0;
						 more_pushing=1;
						 break;
					 }
				 }
			 }
				 
			while(more_pushing==1)
			{
				 for(ulLoop = 0; ulLoop < (300000*CLOCK_RATE / 4); ulLoop++)
				
			   {
				more_pushing=0;
				if(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)==1)
					 {
						 HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)=0;
						 more_pushing=1;
					 }
				 }
			}
			
      if(end_pushing==1){			
			Display96x16x1Clear();
				//blinky=0;
      }
			
		   
			/*  while(HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)){
					  button_count++;
					  
