farhadreza/Display-Bitmap-String-in-OLED-in-LM3S811-ARM-Cortex-M3-Microcontroller/OLED_LM3S811 ARM Cortex M3-Microcontroller.c
					if(button_count==2){
						Display96x16x1ImageDraw(g_pucSmileLogo, 40, 0, 96, 2);
					}
				
				}
			*/
			  
			
			   //Display96x16x1ImageDraw(g_pucSmileLogo, 40, 0, 96, 2);
			  //Display96x16x1ImageDraw(g_pucSurpriseLogo, 40, 0, 96, 2);
			  //Display96x16x1ImageDraw(g_pucSadLogo, 40, 0, 96, 2);
			   //Display96x16x1ImageDraw(g_pucDisappointedLogo, 40, 0, 96, 2);
			
		/*	for(ulLoop = 0; ulLoop < 100000; ulLoop++)
        {
				}
			
			
			
			  if(button_count != HWREGBITW(&g_ulFlags, FLAG_BUTTON))
          {*/
						
						
        //
        // Increment the debounce counter.
        //
       /* HWREGBITW(&g_ulFlags, FLAG_DEBOUNCE_LOW) ^= 1;
        if(!HWREGBITW(&g_ulFlags, FLAG_DEBOUNCE_LOW))
        {
            HWREGBITW(&g_ulFlags, FLAG_DEBOUNCE_HIGH) = 1;
					  Display96x16x1StringDraw("twice",0, 0);
        }
							
							
				
			   else
							Display96x16x1StringDraw("once",0, 0);*/
						
						/* button_count2 = GPIOPinRead(GPIO_PORTC_BASE, PUSH_BUTTON) ? 1 : 0;
						for(ulLoop = 0; ulLoop < 100000; ulLoop++)
        {
				}
			       button_count3 = GPIOPinRead(GPIO_PORTC_BASE, PUSH_BUTTON) ? 1 : 0;
				for(ulLoop = 0; ulLoop < 100000; ulLoop++)
        {
				}
			       button_count4 = GPIOPinRead(GPIO_PORTC_BASE, PUSH_BUTTON) ? 1 : 0;
				for(ulLoop = 0; ulLoop < 100000; ulLoop++)
        {
				}
			       button_count5 = GPIOPinRead(GPIO_PORTC_BASE, PUSH_BUTTON) ? 1 : 0;
				for(ulLoop = 0; ulLoop < 100000; ulLoop++)
        {
				}
			
						
						 if(!button_count2 && !button_count3 && !button_count4 && !button_count5)
						 {
							 Display96x16x1StringDraw("once",0, 0);
						 }
						 
						 else if(button_count2 && !button_count3 && !button_count4 &&!button_count5)
						 {
							 //button_count++;
							 Display96x16x1StringDraw("twice",0, 0);
						 }
						 
						 else if(!button_count2 && button_count3 && !button_count4 && !button_count5)
						 {
							Display96x16x1StringDraw("thrice",0, 0);
						 }
						 
						 else if(!button_count2 && !button_count3 && button_count4 &&!button_count5)
						 {
							 Display96x16x1StringDraw("four",0, 0);
						 }
						 
						 else if(!button_count2 && !button_count3 && !button_count4 &&button_count5)
						 {
							 Display96x16x1StringDraw("five",0, 0);
						 }
						 
						//Display96x16x1StringDraw("Hello World",0, 0);
		      }
					
					*/
					
			/*		for(ulLoop = 0; ulLoop < (CLOCK_RATE / 30); ulLoop++)
        {
            //
            // Wait until a SysTick interrupt has occurred.
            //
            while(!HWREGBITW(&g_ulFlags, FLAG_CLOCK_TICK))
            {
            }

            //
            // Clear the SysTick interrupt flag.
            //
            HWREGBITW(&g_ulFlags, FLAG_CLOCK_TICK) = 0;
        }*/
			
			  /*while(!HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)){
					  
				
				}*/
			
			
			 /* Display96x16x1Clear();
			  Display96x16x1StringDraw("Hello World",0, 0);*/
       /* for(ulLoop = 0; ulLoop < 15000000; ulLoop++)
        {
        }
				for(count = 0; count < 96; count++)
        {
					Display96x16x1StringDraw("Hello World",count, 0);
					
						
					for(ulLoop = 0; ulLoop < 100000; ulLoop++)
        {
				}
				Display96x16x1Clear();
			}
				*/
		//	Output_Init();
      //Output_Color(1);
    //
    // Initialize the OLED display.
    //
      //Display96x16x1Init(true);
				
		  //ScrollImage(g_pucSmileLogo, sizeof(g_pucSmileLogo)/2);
		 /* while(!HWREGBITW(&g_ulFlags, FLAG_BUTTON_PRESS)){
				
				}*/
				
				
			
    }
	
}
